using Domain.Entities;
using Infrastructure.Persistence.Context;
using Microsoft.EntityFrameworkCore;
using Microsoft.Extensions.Logging;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Infrastructure.Persistence.SeedData
{
    public class GenerateSeedData
    {
        public static async Task SeedDataAsync(ApplicationDbContext context, ILoggerFactory loggerFactory)
        {
            try
            {
                if (!await context.ProductBrand.AnyAsync())
                {
                    var brands= DefineSeedBrands();
                    await context.ProductBrand.AddRangeAsync(brands);
                    await context.SaveChangesAsync();
                }
                if (!await context.ProductTypes.AnyAsync())
                {
                   var types = DefineSeedTypes();
                    await context.ProductTypes.AddRangeAsync(types);
                    await context.SaveChangesAsync();
                }
                if (!await context.Products.AnyAsync())
                {
                    var products= DefineSeedProduct();
                    await context.Products.AddRangeAsync(products);
                    await context.SaveChangesAsync();
                }

            }
            catch (Exception e)
            {
                var logger = loggerFactory.CreateLogger<GenerateSeedData>();
                logger.LogError(e, "Error in Seed Data");
            }
        }

        private static List<ProductType> DefineSeedTypes()
        {
            var types = new List<ProductType>()
                    {
                        new()
                        {
                            Id=10001,
                            Title="Laptop",
                            Summary="None",
                        },new()
                        {
                            Id=10002,
                            Title="Mobile",
                            Summary="None",
                        },new()
                        {
                            Id=10003,
                            Title="Tablet",
                            Summary="None",
                        }
                    };
            return types;
            
        }
        private static List<ProductBrand> DefineSeedBrands()
        {
            var brands = new List<ProductBrand>()
                    {
                        new()
                        {
                            Id=1001,
                            Title="ASUS",
                            Summary="None",
                            Description="ASUS Brand"
                        },
                        new()
                        {
                            Id=1002,
                            Title="Apple",
                            Summary="None",
                            Description="Apple Brand"
                        },
                        new()
                        {
                            Id=1003,
                            Title="Lenovo",
                            Summary="None",
                            Description="Lenovo Brand"
                        }
                    };
            return brands;
        }
        private static IEnumerable<Product> DefineSeedProduct()
        {
            var products = new List<Product>()
                    {
                        new()
                        {
                             Description="لپ تاپ 14 اینچی ایسوس مدلM433UA-EB406 که با طراحی زیبا روانه‌ی بازار شده است. این لپ‌تاپ به‌واسطه‌ی قابلیت‌ها و امکاناتی که دارد، علاوه ‌بر کاربری معمول روزمره، برای کاربری مالتی‌مدیا سبک هم مناسب است. بدنه‌ی شیک M433UA-EB406 به‌گونه‌ای طراحی شده که لپ‌تاپی رده‌بالا را نوید می‌دهد. این بدنه 15.9 میلی‌متر ضخامت و 1.4 کیلوگرم وزن دارد و برای جابه‌جایی دائمی آن مشکل خاصی نخواهید داشت. صفحه‌نمایش 14 اینچی این محصول، پنل IPS با وضوح FHD و روکش مات است. پورت‌های متعدد و متنوعی از جمله 2 پورت USB 2.0 و 1 پورت USB 3.2 و پورت‌های HDMI، USB Type-C روی لبه‌های M433UA-EB406 دیده می‌شود که با استفاده از آن‌ها می‌توان انواع ابزارهای جانبی را بدون نیاز به هیچ مبدلی به این لپ‌تاپ متصل و از آن‌ها استفاده کرد. ایسوس در کنار این امکانات متعدد، از سخت‌افزارهای خوبی هم در این محصول استفاده کرده است.",
                             Title="لپ تاپ 14 اینچی ایسوس مدل M433UA-EB406",
                             PictureUrl="",
                             Price=30000000,
                             Summary="None",
                             ProductBrandId=1001,
                             ProductTypeId=10001
                        },
                        new()
                        {
                             Description="لپ ‌تاپ ROG Strix G513IE-HN060 از محصولات شرکت «ایسوس» محسوب می‌شود که با طراحی زیبا روانه بازار شده است. بدنه‌ شیک ROG Strix G513IE-HN060 به‌ گونه‌ای طراحی شده که لپ‌ تاپی رده ‌بالا را نوید می‌‌دهد. این لپ تاپ و 2.1 کیلوگرم وزن دارد و برای جا‌به‌‌جایی دائمی آن مشکل خاصی نخواهید داشت. صفحه ‌نمایش 15.6 اینچی این محصول دارای وضوح تصویر FullHD است. پورت‌های USB و HDMI روی لبه ‌های این مدل از ایسوس دیده می‌‌شود که با استفاده از آن‌‌ها می‌توان انواع ابزارهای جانبی را بدون نیاز به هیچ مبدلی به این لپ‌ تاپ متصل و از آن ‌ها استفاده کرد. ایسوس در کنار این امکانات متعدد، از سخت‌ افزارهای خوبی هم در این محصول استفاده کرده است. پردازنده مرکزی کم‌‌مصرف اما قوی Ryzen7 مدل 4800H، پردازشگر گرافیکی NVIDIA GeForce RTX 3050TI و 8 گیگابایت رم مجموعه‌ سخت‌‌افزاری این لپ‌تاپ را تشکیل می‌‌دهند که برای کاربری روزانه ، مالتی‌مدیا و حتی گیمینگ مطلوب هستند. در مجموع اگر به دنبال خرید یک لپ‌‌تاپ خوش‌‌ساخت و سبک برای انواع کاربری‌ های روزمره خود هستید، این مدل ایسوس می‌‌تواند یکی از انتخاب‌‌های شما باشد. این لپ‌تاپ دارای قدرت پردازشی بسیار بالایی است.\r\n",
                             Title="لپ تاپ 15.6 اینچی ایسوس مدل ROG Strix G513IE-HN060",
                             PictureUrl="",
                             Price=45000000,
                             Summary="None",
                             ProductBrandId=1001,
                             ProductTypeId=10001
                        },
                        new()
                        {
                             Description="امکان برگشت کالا در گروه لپ‌تاپ و الترابوک با دلیل \"انصراف از خرید\" تنها در صورتی مورد قبول است که کالا در شرایط اولیه باشد (در صورت پلمپ بودن، کالا نباید باز شده باشد). تغییرات ایجادشده در لپ‌تاپ‌های کاستوم (برای مثال ارتقا هارد، رم و...) توسط شرکت گارانتی‌کننده و به صورت رسمی انجام شده است و شامل گارانتی می‌شوند. لپ تاپ کاستوم به معنی ارتقا فنی بعضی قطعات لپ تاپ نو (آکبند) و بر اساس استاندارد شرکت تولیدکننده است، لطفا برای اطلاعات بیشتر در این مورد، به سوالات متداول مراجعه فرمایید.\r\n",
                             Title="لپ تاپ 15.6 اینچی ایسوس مدل Vivobook 15 OLED K513EQ-L1789-i7 16GB 512SSD MX350\r\n",
                             PictureUrl="",
                             Price=34700000,
                             Summary="None",
                            ProductBrandId=1001,
                             ProductTypeId=10001
                        },
                        new()
                        {
                             Description="بدون هیچ تعریف اضافی باید بگوییم که iPhone 13 Pro Max یکی از قدرتمند‌ترین گوشی‌های هوشمند پرچمدار موجود در بازار است که توانست رکوردهای جدیدی را به نام خودش ثبت کند. این گوشی به صفحه‌نمایش 6.7 اینچ و رزولوشن 2778x1284 با توانایی نمایش 458 پیکسل در هر اینچ، نرخ بروزرسانی 120 هرتز، حداکثر روشنایی 1200 نیت (nits)، تمام هرآنچه از یک صفحه‌نمایش باکیفیت توقع دارید را در اختیارتان می‌گذارد. در قسمت پشتی سه سنسور دوربین به همراه یک سنسور LIDAR با همان طراحی آیفون 12 پرو مکس قرار گرفته‌اند. یک سنسور دوربین اصلی با رزولوشن 12 مگاپیکسلی با گشودگی دریچه دیافراگم f/1.5، سنسور دوربین 12 مگاپیکسلی از نوع فوق عریض (Ultra Wide) و سنسور 12 مگاپیکسلی از نوع تله فوتو، دوربین سه‌گانه آیفون 13 پرو مکس را تشکیل می دهند. البته سنسور TOF 3D LiDAR scanner هم برای این گوشی در نظر گرفته شده است که عملکردی مشابه ولی بهتر از سنسور سنجش عمق را دارد و قابلیت‏‌های جذابی را در اختیارتان قرار می‌دهد. پردازنده A15 بایونیک هم این‌بار قدرتمند تر از همیشه متشکل از شش هسته این پرچمدار قدرتمند را همراهی می‌کند. حض.ر چنین پردازنده‌ای سبب شاهد تا iPhone 13 Pro Max به راحتی هرچه تمام‌تر از پس اجرای سنگین‌ترین بازی‌های روز دنیا بربیاید. باتری قدرتمند با میزان ظرفیت 4352 میلی‌آمپر‌ساعت این گوشی هم توانایی ارائه طول عمر مفید بهتری به نسبت بسیاری از پرچمداران شرکت‌های دیگر به ازای هر بار شارژ صد درصدی دارد. در مجموع اگر به دنبال یک پرچمدار همه جیز تمام و البته با اصالت هستید، قطعا iPhone 13 Pro Max یکی از بهترین انتخاب‌های ممکن برای شما است. گوشی‌های نات اکتیو با قرار گرفتن سیم‌کارت‌های داخلی اکتیو می‌شوند و برخلاف مدل اکتیو پلمپ کالا باز نشده است. گوشی‌های اکتیو برند اپل هم به این شکل هستند که به دلیل محدودیت‌های برخی از محصولات اپل برای کشور ایران، در کشور‌های همسایه به‌صورت رسمی با یک بار قرار گرفتن سیم‌کارت، اکتیو شده و پلمپ می‌شوند و باید بدانید که این پروسه هیچ مشکلی در راستای گارانتی کالا به‌همراه ندارد. پارت‌نامبر‌های اروپا و ژاپن و امارات تک سیم‌کارت هستند و پارت‌نامبر‌های مربوط به امارات هم از فیس تایم پشتیبانی نمی‌کنند. پارت‌نامبر JA (ژاپن) هم حتی در حالت سایلنت صدای شاتر عکس قطع نمی‌شود.\r\n",
                             Title="گوشی موبایل اپل مدل iPhone 13 Pro Max LLA تک سیم‌ کارت ظرفیت 128 گیگابایت و رم 6 گیگابایت - نات اکتیو\r\n",
                             PictureUrl="",
                             Price=75000000,
                             Summary="None",
                            ProductBrandId=1002,
                             ProductTypeId=10002
                        },
                        new()
                        {
                             Description="لنوو در عرصه تبلت‌های میان‌رده توانسته است محصولات با‌کیفیت و مناسبی را روانه بازار کند. یکی از تبلت‌های مقرون به‌صرفه این شرکت، Tab K10 TB-X6C6X است که به‌نسبت قیمت در نظر گرفته شده، به مشخصات فنی مناسب و قابل قبولی مجهز شده است. در نمای رو‌به‌رویی هم این تبلت از صفحه‌نمایش با ابعاد 10.3 اینچ و رزولوشن 1200×1920 پیکسل از نوع IPS LCD بهره برده است. این صفحه‌نمایش توانایی نمایش 220 پیکسل در هر اینچ و حداکثر روشنایی 330 نیت را دارد. باید گفت که در جایگاه یک تبلت میان‌رده، به صفحه‌نمایش قابل قبولی مجهز شده است. در قسمت پشتی یک سنسور دوربین اصلی با رزولوشن 8 مگاپیکسل و در قسمت جلویی هم یک سنسور دوربین سلفی با رزولوشن 5 مگاپیسل برای این تبلت در نظر گرفته شده است. لازم به ذکر است که سنسور دوربین قسمت پشتی این تبلت توانایی ضبط ویدیو با حداکثر کیفیت 1080p و سرعت 30 فریم در ثانیه را دارد. باتری قدرتمند با میزان ظرفیت 7700 میلی‌آمپر‌ساعت هم به ازای هر بار شارژ صد درصدی، توانایی ارائه طول عمر مفید (زمان آماده به‌کار) مناسبی را خواهد داشت.\r\n",
                             Title="تبلت لنوو مدل Tab K10 TB-X6C6X ظرفیت 64 گیگابایت\r\n",
                             PictureUrl="",
                             Price=18000000,
                             Summary="None",
                            ProductBrandId=1003,
                             ProductTypeId=10003
                        }
                    };
            return products;
        }

    }
}
